# 보안성검토
#### 악성파일 업로드 및 실행이 불가능하도록 적용되었는가?
* 화이트리스트 파일 확장자 필터링 등 적용.
* 파일 저장경로에서 실행 권한 없음.

<br/>

#### 파일이 무단으로 다운로드 되지 않도록 적용되었는가?
* N/A

<br/>

#### 파라미터 값을 이용한 변조 공격이 불가능하도록 적용되었는가?
* 파라미터이 토큰에 포함된 값과 비교하여 일치할 경우만 실행 등 적용.

<br/>

#### Injection 공격이 불가능하도록 적용되었는가?
* 서버에서 특수문자 필터링 등 적용.

<br/>

#### XSS(Cross Site Scripting) 공격이 불가능하도록 적용되었는가?
* 입력값 특수문자 필터링 등 적용.

<br/>

#### 계정발급 절차가 존재하는가?
* O

<br/>

#### 미사용 계정 및 불필요 계정에 대해 주기적으로 폐기되고 있는가?
* 배치로 휴면계정 전환

<br/>

#### 패스워드 생성 및 복구절차가 적용되었는가?
* 전화번호 인증후 생성 및 변경 가능. 토큰이 유효한지 검증.

<br/>

#### 패스워드가 암호화되어 관리되는가?
* SHA512로 암호화 등 적용.

<br/>

#### 패스워드에 대한 변경 정책이 적용되었는가?
* 전화번호 인증후 생성 및 변경 가능. 토큰이 유효한지 검증.

<br/>

#### 서버 접근에 대한 인증이 적용되었는가?
* 스프링 시큐리티, API Gateway 필터링, 요청시 삽입된 토큰이 유효한지 검증 등 적용.

<br/>

#### 관리자페이지가 임의 접근이 불가능하도록 적용되었는가?
* N/A

<br/>

#### 로그인 보안강화 기능이 적용되었는가?
* 스프링 시큐리티

<br/>

#### Replay Attack이 불가능하도록 적용되었는가?
* N/A

<br/>

#### 보안기능(로그인, 체크로직 등)을 우회 불가능하도록 적용되었는가?
* 토큰 미획득시 API 호출 불가능, API Gateway 필터링 등

<br/>

#### 시스템 내 중요정보가 노출되지 않도록 적용되었는가?
* O

<br/>

#### 중요정보 전송시 암호화되어 전송되는가?
* O

<br/>

#### 에러 메시지에서 중요정보가 노출되지 않도록 적용되었는가?
* O
<br/>
#### 디렉토리 리스팅이 불가능하도록 설정되어 있는가?
* N/A

<br/>

#### WAS의 디폴트 패스워드를 변경하였는가?
* O

<br/>

#### 원격에서 소스 생성/수정/삭제가 가능한 서비스를 중지 하였는가?
* N/A

<br/>

#### 개인정보 취급방침, 처리방침 및 약관이 명시되었는가?
* O

<br/>

#### 회원 가입시 만 14세 이상과 미만을 구분하고 있는가?
* 만 18세 이상 이용가능.

<br/>

#### 개인정보 이용에 대해 정보주체(이용자)에게 동의를 받고 있는가?
* O

<br/>

#### 회원정보 조회/수정 시에 재인증을 시행하고 있는가?
* 전화번호 인증.

<br/>

#### 중요 개인정보를 암호화하여 저장하고 있는가?
* O

<br/>

#### 화면에 표시되는 중요 개인정보에 마스킹 처리가 적용되었는가?
* N/A

<br/>

#### 계정 및 패스워드 찾기에 주민번호가 아닌 수단을 사용하고 있는가?
* 전화번호 인증.

<br/>

#### 주민번호를 수집하는 기능이 삭제 되었는가?
* 주민번호 수집 안함.

